r0mbis/w5500-fatfs/libs/targets/stm32g431/dbg/cmsis.svd
            <register>
               <name>AF1</name>
               <displayName>AF1</displayName>
               <description>TIM alternate function option register           1</description>
               <addressOffset>0x60</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKCMP4P</name>
                     <description>BRK COMP4 input polarity</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKCMP3P</name>
                     <description>BRK COMP3 input polarity</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKCMP2P</name>
                     <description>BRK COMP2 input polarity</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKCMP1P</name>
                     <description>BRK COMP1 input polarity</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKINP</name>
                     <description>BRK BKIN input polarity</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKCMP7E</name>
                     <description>BRK COMP7 enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKCMP6E</name>
                     <description>BRK COMP6 enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKCMP5E</name>
                     <description>BRK COMP5 enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKCMP4E</name>
                     <description>BRK COMP4 enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKCMP3E</name>
                     <description>BRK COMP3 enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKCMP2E</name>
                     <description>BRK COMP2 enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKCMP1E</name>
                     <description>BRK COMP1 enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKINE</name>
                     <description>BRK BKIN input enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AF2</name>
               <displayName>AF2</displayName>
               <description>TIM alternate function option register           2</description>
               <addressOffset>0x64</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OCRSEL</name>
                     <description>OCREF_CLR source selection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCR</name>
               <displayName>DCR</displayName>
               <description>DMA control register</description>
               <addressOffset>0x3DC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DBL</name>
                     <description>DMA burst length</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DBA</name>
                     <description>DMA base address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMAR</name>
               <displayName>DMAR</displayName>
               <description>DMA address for full transfer</description>
               <addressOffset>0x3E0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DMAB</name>
                     <description>DMA register for burst               accesses</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
