r0mbis/w5500-fatfs/libs/targets/stm32g431/dbg/cmsis.svd
        </registers>	
    </peripheral>		         
    <peripheral>
         <name>OPAMP</name>
         <description>Operational amplifiers</description>
         <groupName>OPAMP</groupName>
         <baseAddress>0x40010300</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x100</size>
            <usage>registers</usage>
         </addressBlock>
      <registers>
		  <register>
               <name>OPAMP1_CSR</name>
               <displayName>OPAMP1_CSR</displayName>
               <description>OPAMP1 control/status register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OPAEN</name>
                     <description>Operational amplifier               Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FORCE_VP</name>
                     <description>FORCE_VP</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VP_SEL</name>
                     <description>VP_SEL</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>USERTRIM</name>
                     <description>USERTRIM</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VM_SEL</name>
                     <description>VM_SEL</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OPAHSM</name>
                     <description>OPAHSM</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OPAINTOEN</name>
                     <description>OPAINTOEN</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CALON</name>
                     <description>CALON</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CALSEL</name>
                     <description>CALSEL</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PGA_GAIN</name>
                     <description>PGA_GAIN</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>TRIMOFFSETP</name>
                     <description>TRIMOFFSETP</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>TRIMOFFSETN</name>
                     <description>TRIMOFFSETN</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>CALOUT</name>
                     <description>CALOUT</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>LOCK</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
			
            <register>
               <name>OPAMP2_CSR</name>
               <displayName>OPAMP2_CSR</displayName>
               <description>OPAMP2 control/status register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OPAEN</name>
                     <description>Operational amplifier               Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FORCE_VP</name>
                     <description>FORCE_VP</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VP_SEL</name>
                     <description>VP_SEL</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>USERTRIM</name>
                     <description>USERTRIM</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VM_SEL</name>
                     <description>VM_SEL</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OPAHSM</name>
                     <description>OPAHSM</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OPAINTOEN</name>
                     <description>OPAINTOEN</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CALON</name>
                     <description>CALON</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CALSEL</name>
                     <description>CALSEL</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PGA_GAIN</name>
                     <description>PGA_GAIN</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>TRIMOFFSETP</name>
                     <description>TRIMOFFSETP</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>TRIMOFFSETN</name>
                     <description>TRIMOFFSETN</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>CALOUT</name>
                     <description>CALOUT</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>LOCK</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
			
            <register>
               <name>OPAMP3_CSR</name>
               <displayName>OPAMP3_CSR</displayName>
               <description>OPAMP3 control/status register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OPAEN</name>
                     <description>Operational amplifier               Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FORCE_VP</name>
                     <description>FORCE_VP</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VP_SEL</name>
                     <description>VP_SEL</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>USERTRIM</name>
                     <description>USERTRIM</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VM_SEL</name>
                     <description>VM_SEL</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OPAHSM</name>
                     <description>OPAHSM</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OPAINTOEN</name>
                     <description>OPAINTOEN</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CALON</name>
                     <description>CALON</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CALSEL</name>
                     <description>CALSEL</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PGA_GAIN</name>
                     <description>PGA_GAIN</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>TRIMOFFSETP</name>
                     <description>TRIMOFFSETP</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>TRIMOFFSETN</name>
                     <description>TRIMOFFSETN</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>CALOUT</name>
                     <description>CALOUT</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>LOCK</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
			           					 			
            <register>
               <name>OPAMP1_TCMR</name>
               <displayName>OPAMP1_TCMR</displayName>
               <description>OPAMP1 control/status register</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VMS_SEL</name>
                     <description>VMS_SEL</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VPS_SEL</name>
                     <description>VPS_SEL</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>T1CM_EN</name>
                     <description>T1CM_EN</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>T8CM_EN</name>
                     <description>T8CM_EN</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>T20CM_EN</name>
                     <description>T20CM_EN</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>LOCK</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
			
            <register>
               <name>OPAMP2_TCMR</name>
               <displayName>OPAMP2_TCMR</displayName>
               <description>OPAMP2 control/status register</description>
               <addressOffset>0x1C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VMS_SEL</name>
                     <description>VMS_SEL</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VPS_SEL</name>
                     <description>VPS_SEL</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>T1CM_EN</name>
                     <description>T1CM_EN</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>T8CM_EN</name>
                     <description>T8CM_EN</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>T20CM_EN</name>
                     <description>T20CM_EN</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>LOCK</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
			
            <register>
               <name>OPAMP3_TCMR</name>
               <displayName>OPAMP3_TCMR</displayName>
               <description>OPAMP3 control/status register</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VMS_SEL</name>
                     <description>VMS_SEL</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VPS_SEL</name>
                     <description>VPS_SEL</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>T1CM_EN</name>
                     <description>T1CM_EN</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>T8CM_EN</name>
                     <description>T8CM_EN</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>T20CM_EN</name>
                     <description>T20CM_EN</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>LOCK</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
			            			           			          					
