r0mbis/w5500-fatfs/libs/targets/stm32g431/dbg/cmsis.svd
            <register>
               <name>BKP12R</name>
               <displayName>BKP12R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x130</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP13R</name>
               <displayName>BKP13R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x134</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP14R</name>
               <displayName>BKP14R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x138</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP15R</name>
               <displayName>BKP15R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x13C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP16R</name>
               <displayName>BKP16R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x140</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP17R</name>
               <displayName>BKP17R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x144</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP18R</name>
               <displayName>BKP18R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x148</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP19R</name>
               <displayName>BKP19R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x14C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP20R</name>
               <displayName>BKP20R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x150</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP21R</name>
               <displayName>BKP21R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x154</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP22R</name>
               <displayName>BKP22R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x158</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP23R</name>
               <displayName>BKP23R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x15C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP24R</name>
               <displayName>BKP24R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x160</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP25R</name>
               <displayName>BKP25R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x164</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP26R</name>
               <displayName>BKP26R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x168</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP27R</name>
               <displayName>BKP27R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x16C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP28R</name>
               <displayName>BKP28R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x170</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP29R</name>
               <displayName>BKP29R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x174</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP30R</name>
               <displayName>BKP30R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x178</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP31R</name>
               <displayName>BKP31R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x17C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
